jmeter-loader-skills/assets/templates/auth_flow.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.4.1">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="鉴权业务流程模板" enabled="true">
      <stringProp name="TestPlan.comments">鉴权业务流程模板 - 包含登录、令牌刷新和业务请求的完整流程

参数说明:
- concurrency: 并发用户数 (默认: 10)
- rampup: Ramp-up时间(秒) (默认: 10)
- duration: 压测持续时间(秒) (默认: 60)
- target_host: 目标主机 (默认: localhost)
- target_port: 目标端口 (默认: 80)
- protocol: 协议类型 (默认: http)
- login_path: 登录接口路径 (默认: /api/auth/login)
- refresh_path: Token刷新路径 (默认: /api/auth/refresh)
- business_path: 业务接口路径 (默认: /api/business/data)
- login_username: 登录用户名 (默认: admin)
- login_password: 登录密码 (默认: password)
- token_header_name: Token请求头名称 (默认: Authorization)
- token_prefix: Token前缀 (默认: Bearer )
- think_time: 思考时间(毫秒) (默认: 2000)
- token_refresh_interval: Token刷新间隔(秒) (默认: 1800)
- result_file: 结果文件路径 (默认: result.jtl)
</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="用户定义的变量" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="auth_token" elementType="Argument">
            <stringProp name="Argument.name">auth_token</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="refresh_token" elementType="Argument">
            <stringProp name="Argument.name">refresh_token</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="token_acquired_time" elementType="Argument">
            <stringProp name="Argument.name">token_acquired_time</stringProp>
            <stringProp name="Argument.value">0</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="is_logged_in" elementType="Argument">
            <stringProp name="Argument.name">is_logged_in</stringProp>
            <stringProp name="Argument.value">false</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="TG_Auth_Business_Flow" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">startnextloop</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="循环控制器" enabled="true">
          <boolProp name="LoopController.continue_forever">true</boolProp>
          <stringProp name="LoopController.loops">-1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(concurrency,10)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(rampup,10)}</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(duration,60)}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP请求默认值" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="用户定义的变量" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${__P(target_host,localhost)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(target_port,80)}</stringProp>
          <stringProp name="HTTPSampler.protocol">${__P(protocol,http)}</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.concurrentPool">6</stringProp>
          <boolProp name="HTTPSampler.embedded_url_re">false</boolProp>
        </ConfigTestElement>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP信息头管理器" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Connection</stringProp>
              <stringProp name="Header.value">keep-alive</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="HTTP Cookie管理器" enabled="true">
          <collectionProp name="CookieManager.cookies"/>
          <boolProp name="CookieManager.clearEachIteration">false</boolProp>
          <boolProp name="CookieManager.controlledByThreadGroup">true</boolProp>
        </CookieManager>
        <hashTree/>
        <IfController guiclass="IfControllerPanel" testclass="IfController" testname="需要登录或Token过期" enabled="true">
          <stringProp name="IfController.condition">${__jexl3("${is_logged_in}" == "false" || (${__time()} - ${token_acquired_time}) > ${__P(token_refresh_interval,1800)} * 1000,)}</stringProp>
          <boolProp name="IfController.evaluateAll">false</boolProp>
          <boolProp name="IfController.useExpression">true</boolProp>
        </IfController>
        <hashTree>
          <TransactionController guiclass="TransactionControllerGui" testclass="TransactionController" testname="TC_Login_Flow" enabled="true">
            <boolProp name="TransactionController.include_timers">true</boolProp>
            <boolProp name="TransactionController.parent">false</boolProp>
          </TransactionController>
          <hashTree>
            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP_Login" enabled="true">
              <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="用户定义的变量" enabled="true">
                <collectionProp name="Arguments.arguments">
                  <elementProp name="" elementType="HTTPArgument">
                    <boolProp name="HTTPArgument.always_encode">false</boolProp>
                    <stringProp name="Argument.value">{"username":"${__P(login_username,admin)}","password":"${__P(login_password,password)}"}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                    <boolProp name="HTTPArgument.use_equals">true</boolProp>
                  </elementProp>
                </collectionProp>
              </elementProp>
              <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
              <stringProp name="HTTPSampler.path">${__P(login_path,/api/auth/login)}</stringProp>
              <stringProp name="HTTPSampler.method">POST</stringProp>
              <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
              <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
              <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
              <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
              <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
              <stringProp name="HTTPSampler.connect_timeout">30000</stringProp>
              <stringProp name="HTTPSampler.response_timeout">60000</stringProp>
            </HTTPSamplerProxy>
            <hashTree>
              <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JE_Login_Response" enabled="true">
                <stringProp name="JSONPostProcessor.referenceNames">auth_token,refresh_token,token_expires_in</stringProp>
                <stringProp name="JSONPostProcessor.jsonPathExprs">$.data.accessToken,$.data.refreshToken,$.data.expiresIn</stringProp>
                <stringProp name="JSONPostProcessor.match_numbers">1,1,1</stringProp>
                <stringProp name="JSONPostProcessor.default_values">NOT_FOUND,NOT_FOUND,0</stringProp>
              </JSONPostProcessor>
              <hashTree/>
              <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="RA_Login_StatusCode" enabled="true">
                <collectionProp name="Asserter.testStrings">
                  <elementProp name="" elementType="string">
                    <stringProp name="Argument.value">200</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                </collectionProp>
                <stringProp name="Assertion.custom_message">登录失败 - 状态码不是200</stringProp>
                <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
                <boolProp name="Assertion.assume_success">false</boolProp>
                <intProp name="Assertion.test_type">16</intProp>
              </ResponseAssertion>
              <hashTree/>
              <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="RA_Has_Token" enabled="true">
                <collectionProp name="Asserter.testStrings">
                  <elementProp name="" elementType="string">
                    <stringProp name="Argument.value">accessToken</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                </collectionProp>
                <stringProp name="Assertion.custom_message">登录响应中未找到Token</stringProp>
                <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
                <boolProp name="Assertion.assume_success">false</boolProp>
                <intProp name="Assertion.test_type">2</intProp>
              </ResponseAssertion>
              <hashTree/>
            </hashTree>
            <IfController guiclass="IfControllerPanel" testclass="IfController" testname="登录成功后更新状态" enabled="true">
              <stringProp name="IfController.condition">${__jexl3("${auth_token}" != "NOT_FOUND",)}</stringProp>
              <boolProp name="IfController.evaluateAll">false</boolProp>
              <boolProp name="IfController.useExpression">true</boolProp>
            </IfController>
            <hashTree>
              <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="更新登录状态变量" enabled="true">
                <stringProp name="BeanShellSampler.query">vars.put("is_logged_in", "true");
vars.put("token_acquired_time", String.valueOf(System.currentTimeMillis()));
SampleResult.setSuccessful(true);
SampleResult.setResponseData("登录状态已更新", "UTF-8");</stringProp>
                <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
              </BeanShellSampler>
              <hashTree/>
            </hashTree>
          </hashTree>
          <IfController guiclass="IfControllerPanel" testclass="IfController" testname="Token过期尝试刷新" enabled="true">
            <stringProp name="IfController.condition">${__jexl3("${is_logged_in}" == "true" &amp;&amp; "${auth_token}" != "NOT_FOUND" &amp;&amp; "${refresh_token}" != "NOT_FOUND",)}</stringProp>
            <boolProp name="IfController.evaluateAll">false</boolProp>
            <boolProp name="IfController.useExpression">true</boolProp>
          </IfController>
          <hashTree>
            <TransactionController guiclass="TransactionControllerGui" testclass="TransactionController" testname="TC_Token_Refresh" enabled="true">
              <boolProp name="TransactionController.include_timers">true</boolProp>
              <boolProp name="TransactionController.parent">false</boolProp>
            </TransactionController>
            <hashTree>
              <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP_Refresh_Token" enabled="true">
                <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="用户定义的变量" enabled="true">
                  <collectionProp name="Arguments.arguments">
                    <elementProp name="" elementType="HTTPArgument">
                      <boolProp name="HTTPArgument.always_encode">false</boolProp>
                      <stringProp name="Argument.value">{"refreshToken":"${refresh_token}"}</stringProp>
                      <stringProp name="Argument.metadata">=</stringProp>
                      <boolProp name="HTTPArgument.use_equals">true</boolProp>
                    </elementProp>
                  </collectionProp>
                </elementProp>
                <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
                <stringProp name="HTTPSampler.path">${__P(refresh_path,/api/auth/refresh)}</stringProp>
                <stringProp name="HTTPSampler.method">POST</stringProp>
                <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
                <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
                <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
                <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
                <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
              </HTTPSamplerProxy>
              <hashTree>
                <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HM_Refresh_Auth" enabled="true">
                  <collectionProp name="HeaderManager.headers">
                    <elementProp name="" elementType="Header">
                      <stringProp name="Header.name">${__P(token_header_name,Authorization)}</stringProp>
                      <stringProp name="Header.value">${__P(token_prefix,Bearer )}${auth_token}</stringProp>
                    </elementProp>
                  </collectionProp>
                </HeaderManager>
                <hashTree/>
                <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JE_Refresh_Response" enabled="true">
                  <stringProp name="JSONPostProcessor.referenceNames">auth_token,refresh_token</stringProp>
                  <stringProp name="JSONPostProcessor.jsonPathExprs">$.data.accessToken,$.data.refreshToken</stringProp>
                  <stringProp name="JSONPostProcessor.match_numbers">1,1</stringProp>
                  <stringProp name="JSONPostProcessor.default_values">NOT_FOUND,NOT_FOUND</stringProp>
                </JSONPostProcessor>
                <hashTree/>
              </hashTree>
              <IfController guiclass="IfControllerPanel" testclass="IfController" testname="刷新成功更新Token时间" enabled="true">
                <stringProp name="IfController.condition">${__jexl3("${auth_token}" != "NOT_FOUND",)}</stringProp>
                <boolProp name="IfController.evaluateAll">false</boolProp>
                <boolProp name="IfController.useExpression">true</boolProp>
              </IfController>
              <hashTree>
                <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="更新Token时间" enabled="true">
                  <stringProp name="BeanShellSampler.query">vars.put("token_acquired_time", String.valueOf(System.currentTimeMillis()));
SampleResult.setSuccessful(true);
SampleResult.setResponseData("Token刷新成功，时间已更新", "UTF-8");</stringProp>
                  <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
                </BeanShellSampler>
                <hashTree/>
              </hashTree>
              <IfController guiclass="IfControllerPanel" testclass="IfController" testname="刷新失败重置状态" enabled="true">
                <stringProp name="IfController.condition">${__jexl3("${auth_token}" == "NOT_FOUND",)}</stringProp>
                <boolProp name="IfController.evaluateAll">false</boolProp>
                <boolProp name="IfController.useExpression">true</boolProp>
              </IfController>
              <hashTree>
                <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="重置登录状态" enabled="true">
                  <stringProp name="BeanShellSampler.query">vars.put("is_logged_in", "false");
vars.put("auth_token", "");
vars.put("refresh_token", "");
SampleResult.setSuccessful(true);
SampleResult.setResponseData("Token刷新失败，重置登录状态", "UTF-8");</stringProp>
                  <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
                </BeanShellSampler>
                <hashTree/>
              </hashTree>
            </hashTree>
          </hashTree>
        </hashTree>
        <IfController guiclass="IfControllerPanel" testclass="IfController" testname="已登录状态执行业务请求" enabled="true">
          <stringProp name="IfController.condition">${__jexl3("${is_logged_in}" == "true" &amp;&amp; "${auth_token}" != "NOT_FOUND",)}</stringProp>
          <boolProp name="IfController.evaluateAll">false</boolProp>
          <boolProp name="IfController.useExpression">true</boolProp>
        </IfController>
        <hashTree>
          <TransactionController guiclass="TransactionControllerGui" testclass="TransactionController" testname="TC_Business_Flow" enabled="true">
            <boolProp name="TransactionController.include_timers">true</boolProp>
            <boolProp name="TransactionController.parent">false</boolProp>
          </TransactionController>
          <hashTree>
            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP_Get_Business_Data" enabled="true">
              <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="用户定义的变量" enabled="true">
                <collectionProp name="Arguments.arguments"/>
              </elementProp>
              <stringProp name="HTTPSampler.path">${__P(business_path,/api/business/data)}</stringProp>
              <stringProp name="HTTPSampler.method">GET</stringProp>
              <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
              <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
              <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
              <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
            </HTTPSamplerProxy>
            <hashTree>
              <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HM_Business_Auth" enabled="true">
                <collectionProp name="HeaderManager.headers">
                  <elementProp name="" elementType="Header">
                    <stringProp name="Header.name">${__P(token_header_name,Authorization)}</stringProp>
                    <stringProp name="Header.value">${__P(token_prefix,Bearer )}${auth_token}</stringProp>
                  </elementProp>
                  <elementProp name="" elementType="Header">
                    <stringProp name="Header.name">X-Request-ID</stringProp>
                    <stringProp name="Header.value">${__UUID}</stringProp>
                  </elementProp>
                </collectionProp>
              </HeaderManager>
              <hashTree/>
              <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="RA_Business_StatusCode" enabled="true">
                <collectionProp name="Asserter.testStrings">
                  <elementProp name="" elementType="string">
                    <stringProp name="Argument.value">200</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                </collectionProp>
                <stringProp name="Assertion.custom_message">业务请求失败</stringProp>
                <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
                <boolProp name="Assertion.assume_success">false</boolProp>
                <intProp name="Assertion.test_type">16</intProp>
              </ResponseAssertion>
              <hashTree/>
              <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="RA_Token_Expired" enabled="true">
                <collectionProp name="Asserter.testStrings">
                  <elementProp name="" elementType="string">
                    <stringProp name="Argument.value">401</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                  <elementProp name="" elementType="string">
                    <stringProp name="Argument.value">token</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                </collectionProp>
                <stringProp name="Assertion.custom_message">检测到Token过期</stringProp>
                <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
                <boolProp name="Assertion.assume_success">false</boolProp>
                <intProp name="Assertion.test_type">20</intProp>
              </ResponseAssertion>
              <hashTree>
                <BeanShellPostProcessor guiclass="BeanShellPostProcessorGui" testclass="BeanShellPostProcessor" testname="Token过期时重置状态" enabled="true">
                  <stringProp name="BeanShellPostProcessor.query">String responseCode = prev.getResponseCode();
if ("401".equals(responseCode)) {
    vars.put("is_logged_in", "false");
    vars.put("auth_token", "");
    log.info("Token 已过期，重置登录状态");
}</stringProp>
                  <boolProp name="BeanShellPostProcessor.resetInterpreter">false</boolProp>
                </BeanShellPostProcessor>
                <hashTree/>
              </hashTree>
            </hashTree>
            <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="TM_ThinkTime_After_Business" enabled="true">
              <stringProp name="ConstantTimer.delay">${__P(think_time,2000)}</stringProp>
            </ConstantTimer>
            <hashTree/>
          </hashTree>
        </hashTree>
        <IfController guiclass="IfControllerPanel" testclass="IfController" testname="未登录状态跳过" enabled="true">
          <stringProp name="IfController.condition">${__jexl3("${is_logged_in}" == "false",)}</stringProp>
          <boolProp name="IfController.evaluateAll">false</boolProp>
          <boolProp name="IfController.useExpression">true</boolProp>
        </IfController>
        <hashTree>
          <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="等待登录完成" enabled="true">
            <stringProp name="BeanShellSampler.query">SampleResult.setSuccessful(true);
SampleResult.setResponseData("未登录状态，等待登录完成后再执行业务请求", "UTF-8");</stringProp>
            <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
          </BeanShellSampler>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="查看结果树" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">${__P(result_file,result.jtl)}</stringProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>